# RunTopLowerThanBottomFailure Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..RunTopLowerThanBottomFailure Property
BuiltInFailures..::..StairRampFailures Class See Also
---
The top elevation for the run is lower than the base elevation for the run.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RunTopLowerThanBottomFailure { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RunTopLowerThanBottomFailure As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RunTopLowerThanBottomFailure {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace